# -*-coding:utf-8-*-
import os
dir = r"D:\中国蔬菜协会data\生产者价格"
dirs = os.listdir(dir)
'''for dirc in dirs:
    print(dirc)
'''
print(dirs)
print(len(dirs))
[
    '[2019-1-1—2019-11-23]丝瓜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]冬瓜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]包心芥菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]南瓜信息速采(部省)汇总查询.xls',
    '[2019-1-1 —2019-11-23]四季豆信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]大白菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]大葱信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]大蒜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]娃娃菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]尖椒信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]扁豆 信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]油菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]甘蓝信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]生姜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]生菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]番茄信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]白菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]白萝卜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]空心菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]胡萝卜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]芥菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]花椰菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]花菜信息速采(部省)汇总查询.xls',
    '[2019-1-1 —2019-11-23]芹菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]苦瓜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]茄子信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]莲藕信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]莴 笋信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]菠菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]西兰花信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]西芹信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]西葫芦信息速采( 部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]豆角信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]豇豆信息速采(部省)汇 总查询.xls',
    '[2019-1-1—2019-11-23]辣椒信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]青菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]韭菜信息速采(部省)汇总查询.xls',
    '[2019-1-1—2019-11-23]黄瓜信息速采(部省)汇总查询.xls'
]
