#提取
import pandas as pd
#python D:\Github\xfd_vegetable_price\waterVegCollect.py
waterVegList = [
    '新发地水菜价格表-20180723.xls', '新发地水菜价格表-20180724.xls', '新发地水菜价格表-20180725.xls',
    '新发地水菜价格表-20180726.xls', '新发地水菜价格表-20180727.xls', '新发地水菜价格表-20180730.xls',
    '新发地水菜价格表-20180731.xls', '新发地水菜价格表-20180801.xls', '新发地水菜价格表-20180802.xls',
    '新发地水菜价格表-20180803.xls', '新发地水菜价格表-20180806.xls', '新发地水菜价格表-20180807.xls',
    '新发地水菜价格表-20180808.xls', '新发地水菜价格表-20180809.xls', '新发地水菜价格表-20180810.xls',
    '新发地水菜价格表-20180813.xls', '新发地水菜价格表-20180814.xls', '新发地水菜价格表-20180815.xls',
    '新发地水菜价格表-20180816.xls', '新发地水菜价格表-20180817.xls', '新发地水菜价格表-20180820.xls',
    '新发地水菜价格表-20180821.xls', '新发地水菜价格表-20180822.xls', '新发地水菜价格表-20180824.xls',
    '新发地水菜价格表-20180827.xls', '新发地水菜价格表-20180828.xls', '新发地水菜价格表-20180829.xls',
    '新发地水菜价格表-20180830.xls', '新发地水菜价格表-20180831.xls', '新发地水菜价格表-20180903.xls',
    '新发地水菜价格表-20180904.xls', '新发地水菜价格表-20180905.xls', '新发地水菜价格表-20180906.xls',
    '新发地水菜价格表-20180907.xls', '新发地水菜价格表-20180910.xls', '新发地水菜价格表-20180911.xls',
    '新发地水菜价格表-20180912.xls', '新发地水菜价格表-20180913.xls', '新发地水菜价格表-20180914.xls',
    '新发地水菜价格表-20180917.xls', '新发地水菜价格表-20180918.xls', '新发地水菜价格表-20180919.xls',
    '新发地水菜价格表-20180920.xls', '新发地水菜价格表-20180921.xls', '新发地水菜价格表-20180924.xls',
    '新发地水菜价格表-20180925.xls', '新发地水菜价格表-20180926.xls', '新发地水菜价格表-20180927.xls',
    '新发地水菜价格表-20180928.xls', '新发地水菜价格表-20181001.xls', '新发地水菜价格表-20181002.xls',
    '新发地水菜价格表-20181003.xls', '新发地水菜价格表-20181004.xls', '新发地水菜价格表-20181005.xls',
    '新发地水菜价格表-20181008.xls', '新发地水菜价格表-20181009.xls', '新发地水菜价格表-20181010.xls',
    '新发地水菜价格表-20181011.xls', '新发地水菜价格表-20181012.xls', '新发地水菜价格表-20181015.xls',
    '新发地水菜价格表-20181016.xls', '新发地水菜价格表-20181017.xls', '新发地水菜价格表-20181018.xls',
    '新发地水菜价格表-20181019.xls', '新发地水菜价格表-20181022.xls', '新发地水菜价格表-20181023.xls',
    '新发地水菜价格表-20181024.xls', '新发地水菜价格表-20181025.xls', '新发地水菜价格表-20181026.xls',
    '新发地水菜价格表-20181029.xls', '新发地水菜价格表-20181030.xls', '新发地水菜价格表-20181031.xls',
    '新发地水菜价格表-20181101.xls', '新发地水菜价格表-20181102.xls', '新发地水菜价格表-20181105.xls',
    '新发地水菜价格表-20181106.xls', '新发地水菜价格表-20181107.xls', '新发地水菜价格表-20181108.xls',
    '新发地水菜价格表-20181109.xls', '新发地水菜价格表-20181112.xls', '新发地水菜价格表-20181113.xls',
    '新发地水菜价格表-20181114.xls', '新发地水菜价格表-20181115.xls', '新发地水菜价格表-20181116.xls',
    '新发地水菜价格表-20181119.xls', '新发地水菜价格表-20181120.xls', '新发地水菜价格表-20181121.xls',
    '新发地水菜价格表-20181122.xls', '新发地水菜价格表-20181123.xls', '新发地水菜价格表-20181126.xls',
    '新发地水菜价格表-20181127.xls', '新发地水菜价格表-20181128.xls', '新发地水菜价格表-20181129.xls',
    '新发地水菜价格表-20181130.xls', '新发地水菜价格表-20181203.xls', '新发地水菜价格表-20181204.xls',
    '新发地水菜价格表-20181205.xls', '新发地水菜价格表-20181206.xls'
]

#提取第一个文件
df = pd.read_excel(
    r"C:usecolsva_b\Desktop\菜价\水菜\新发地水菜价格表-20180723.xls",
    sheet_name='Sheet1',
    header=None,
    names=["品种", "最低价（元/斤）", "最高价（元/斤）", "平均价（元/斤）", "上市量（万吨）", "交易额（万元）"],
    skiprows=3,
    skipfooter=3,
    use_cols='A:F')
#print(df.describe())
df['日期'] = '2018-07-23'
print(df.head())

#提取其他文件
for i in range(1, len(waterVegList)):
    docName = waterVegList[i]
    doc_address = r'C:\Users\cva_b\Desktop\菜价\水菜'
    doc_address += '\\' + docName
    #print("本次打开的文件名为：", docName)
    df_temp = pd.read_excel(
        doc_address,
        sheet_name='Sheet1',
        header=None,
        names=["品种", "最低价（元/斤）", "最高价（元/斤）", "平均价（元/斤）", "上市量（万吨）", "交易额（万元）"],
        skiprows=3,
        skipfooter=3,
        use_cols='A:F')
    #print(df_temp.head())
    colDate = str(docName[9:13]) + '-' + str(docName[13:15]) + '-' + str(
        docName[15:17])
    #print('本次添加的colDate为：', colDate)
    #print(type(colDate))
    df_temp['日期'] = colDate
    df = df.append(df_temp)
    i += 1

print(df.tail())
writer = r'D:\Data\新发地菜价\水菜\水菜价格汇总20180723-1206.xls'
df.to_excel(writer, sheet_name='水菜价格汇总', index=False)

#python D:\Github\xfd_vegetable_price\waterVegCollect.py
